
<?php
$status = Array
(
    21=>"داخل السجن",
    30=>"داخل السجن",
    40=>"خارج السجن",
    50=>"داخل السجن",
    60=>"داخل السجن",
    70=>"خارج السجن",
    80=>"داخل السجن",
    90=>"خارج السجن",
    100=>"داخل السجن",
    110=>"خارج السجن"
);



$details = Array
(
    '21' => Array
    (
        "الاسم"=>"محمد",
        "العمر" => 52,
        "أوصافه" =>  "اشقر الشعر - أبيض الوجه - ملتحي" ,
        "رقمه المميز" => 75,
    )
,
    '30' => Array
    (
        "الاسم"=>"محم11د",
        "العمر" => 22,
        "أوصافه" =>  "اسود الشعر - طويل - اسود الوجه" ,
        "رقمه المميز" => 102,
    )
,
    '40' => Array
    (
        "الاسم"=>"خليل",
        "العمر" => 36,
        "أوصافه" =>  "ابيض الوجه - ملتحي - أصلع" ,
        "رقمه المميز" => 111,
    )
,
    '50' => Array
    (
        "الاسم"=>"عادل",
        "العمر" => 20,
        "أوصافه" =>  "ابيض الوجه - ملتحي - أصلع" ,
        "رقمه المميز" => 774,
    )
,
    '60' => Array
    (
        "الاسم"=>"عدنان",
        "العمر" => 31,
        "أوصافه" =>  "ابيض الوجه - ملتحي - أصلع" ,
        "رقمه المميز" => 114,
    )
,
    '70' => Array
    (
        "الاسم"=>"خليل",
        "العمر" => 44,
        "أوصافه" =>  "ابيض الوجه - ملتحي - أصلع" ,
        "رقمه المميز" => 445,
    )
,
    '80' => Array
    (
        "الاسم"=>"مجد",
        "العمر" => 32,
        "أوصافه" =>  "ابيض الوجه - ملتحي - أصلع" ,
        "رقمه المميز" => 778,
    )
,
    '90' => Array
    (
        "الاسم"=>"احمد",
        "العمر" => 40,
        "أوصافه" =>  "ابيض الوجه - ملتحي - أصلع" ,
        "رقمه المميز" => 888,
    )
,
    '100' => Array
    (
        "الاسم"=>"محمود",
        "العمر" => 21,
        "أوصافه" =>  "ابيض الوجه - ملتحي - أصلع" ,
        "رقمه المميز" => 115,
    )
,
    '110' => Array
    (
        "الاسم"=>"حسن",
        "العمر" => 19,
        "أوصافه" =>  "ابيض الوجه - ملتحي - أصلع" ,
        "رقمه المميز" => 119,
    )
);
function Check($x="")
{
    global $details;
    global $status;
    if($x!= null) {
        foreach ($details as $k => $v) {
            foreach ($v as $k1 => $v1) {
                if ($x == $v1) {
                    foreach ($status as $key => $value) {
                        if ($key == $k) {
                            echo "المجرم الذي يحمل الرقم التسلسلي " . $v1;
                            echo "<br>";
                            echo "الحاله الخاصه به " . $value;
                        }


                    }
                }

            }


        }
    }else
        echo "لا يوجد بيانات";
}

Check(75);
echo "<br>";
Check(888);
echo "<br>";
Check(100);
echo "<br>";
// اذا طلبنا وما كان في بيانات راح يظهر الرسالة لا يوجد بيانات
Check();

?>
